package org.homework.secondTasks.differentTask;

 class MyClass {

    // Закриті поля:
    private int code;
    private String name;

    // Конструктор:
    MyClass(int n, String s) {
        System.out.println("Створення об'єкта:");
// Присвоєння значень полям та
// відображення цих значень:
        set(n, s).show();
    }

    // Метод для присвоєння значення цілочисловому полю,
// який повертає результатом посилання на об'єкт:
    MyClass set(int n) {
// Присвоєння значення цілочисловому полю:
        code = n;
// Результат методу:
        return this;
    }

    //  Якщо метод повертає результатом об'єкт, то формально це об'єктна
    // змінна з посиланням на об'єкт
    // Метод для присвоєння значення текстовому полю,
// який повертає результатом посилання на об'єкт:
    MyClass set(String s) {
// Присвоєння значення текстовому полю:
        name = s;
// Результат методу:
        return this;
    }

    // Метод для присвоєння значень полям,
// який повертає результатом посилання на об'єкт:
    MyClass set(int n, String s) {
// Присвоєння значень полям і результат методу:
        return set(n).set(s);
    }
// Метод для відображення значень полів:


     void show(){
         System.out.println("Поле code="+code);
         System.out.println("Поле name="+name);
         System.out.println("-----------------");
     }
 }

class Demo{
    // Статичний метод для створення об'єкта:
    static MyClass createObject(int n,String s){
// Результат методу:
        return new MyClass(n,s);
    }
    // Головний метод програми:
    public static void main(String[] args){
// Создание объекта:
        MyClass obj=createObject(100,"alpha");
// Зміна значень цілочислового поля і
// відображення значень полів об'єкта:
        obj.set(200).show();
// Зміна значення текстового поля і
// відображення значень полів об'єкта:
        obj.set("bravo").show();
// Відображення значень полів:
        obj.show();
// Створення об'єкта, зміна значень його полів
// і виклик методу для відображення значень полів:
        createObject(300,"charlie").set(400,"delta").show();
    }
}

