package org.homework.secondTasks.paralepiped;

// Напишіть програму, в якій створюється клас для опису такого фізичного
//об'єкта, як "паралелепіпед". У класа три поля: ширина, глибина та висота, а також
//метод для обчислення об'єму (добуток значень полів об'єкта). Передбачити
//наявність конструктора та методу для відображення характеристик об'єкта.
//Розгляньте механізм успадкування, створивши на основі класу підклас із
//додатковим полем, що визначає масу "паралелепіпеда". Додати в підклас метод
//для обчислення густини матеріалу, з якого зроблений "паралелепіпед" (масу
//потрібно поділити на об’єм). Подумайте над тим, як додати до класа методи для
//виконання деяких простих операцій з об'єктами: наприклад, метод зменшення
//маси "паралелепіпеда" у певну кількість разів, або метод для створення нового
//об'єкта на основу двох вже існуючих. Об’єм створеного об'єкта дорівнює сумі
//об’ємів вихідних об'єктів, його маса дорівнює сумі мас вихідних об'єктів, а три
//лінійних розміри однакові.
public class Parallelepipedon {

  private  double width;

  private double depth;

  private double height;

  public  double volume(){ // метод для знаходження обьему
     return width*depth*height;
  }

    public Parallelepipedon(double width, double depth, double height) {
        this.width = width;
        this.depth = depth;
        this.height = height;
    }

    public Parallelepipedon() {
    }


}
