package org.homework.secondTasks;


// Напишіть програму з класом, в якому є цілочислове поле. В класі
//опишіть перевантажений нестатичний метод, який дозволяє
//створювати копію об'єкту, з якого викликається метод (без
//аргументів). Якщо метод викликається з цілочисловим аргументом,
//то передане аргументом значення присвоюється полю об'єкта, з
//якого викликається метод. Значення полю створюваного об'єкта
//визначається "старим" значенням поля об'єкта, з якого
//викликається метод

public class Dog {

    int age;




}
