package org.homework.secondTasks;

// ● Напишіть програму з двома класами. У першого класу є цілочислове поле. У
//другого класу є символьне поле.
//В першому класі є метод, аргументом якому передається об'єкт другого класу. При
//виклику цього методу полю об'єкта, з якого викликається метод, значенням
//присвоюється код символу, що є значенням поля об'єкта, переданого аргументом
//методу.
//У другого класу є метод, аргументом якому передається об'єкт першого класу.
//Значенням полю об'єкта, з якого викликається метод, присвоюється символ з кодом,
//що визначається значенням поля об'єкта, переданого аргументом методу

 /*public class EntytiFirst {

    private int number;

    public int getNumber() {
        return number;
    }

    public void setNumber(int number) {
        this.number = number;
    }

    public void method(EntytiSecond entytiSecond){

         this.number = entytiSecond.getCumb();
    }

}



*/